# MarkupsModified Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MarkupsModified Property
ParameterTypeId Class See Also
---
"Modified"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MarkupsModified { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MarkupsModified As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MarkupsModified {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace